# Дан словарь, состоящий из элементов типа: слово-синоним. Все слова в словаре
# различны. Выведите синоним для последнего слова.

synonyms = {'hi': 'hello', 'bye':'goodbye'}
print(synonyms)
print(synonyms['bye'])
